START_MESSAGE_FOR_NEW = 'Добро пожаловать в нашего бота 🔮\nЗдесь вы можете найти себе тимейтов по интересам 🔫\n\nДля начала, введите свой никнейм в стиме:'
ERROR_USERNAME = 'Для использования бота, необходимо установить юзернейм в настройках Телеграма.\nЕсли у вас не будет юзернейма, тимейты не смогу с вами связаться 🥺\n\nКак только закончите с настройками, нажмите /start'

ACCOUNT_STEAM = 'Введите никнейм в Steam 🎲'
ACCOUNT_ABOUT_ME = 'Кратко расскажите о себе и своих увлечениях, предпочтениях 😃'
ACCOUNT_CATEGORY = 'Выберите предпочитаемый жанр игр 🕹'
ACCOUNT_GAME = 'Отличный выбор!\n{}\n\nВыберите любимую игру в в вашем жанре 🎮'
ACCOUNT_COMPLETE = 'Анкета успешно создана ✅\n\nВыберите дальнейшее действие'

MAIN_MENU = 'Выберите действие 🪄'
PROFILE = 'Steam: {}\nО себе:{}\nЛюбимая игра: {}\n\nНажмите кнопки ниже, чтобы отредактировать анкету ✏️'
DELETE_PROFILE = 'Ваша анкета отключена ❌'
RETURN_PROFILE = 'С возвращением! Ваша анкета успешно восстановлена ✅'
UPDATE_PROFILE = 'Информация успешно обновлена ✅\n\n'

SEARCH_CATEGORY_SELECT = 'Выберите категорию игр, в которой вы хотите найти тимейта 🔫'
SEARCH_GAME_SELECT = 'Выберите игру, по которой хотите найти тимейта 🕹'
SEARCH_MEM = ['Нашелся тут один 🧐\n\n', 'Интересная кандидатура 🤔\n\n', 'Вот этот неплох 😏\n\n']
SEARCH_PLAYER = '🪄 Steam: {}\n🕹 Основная игра: {}\n📋 О себе: {}'
SEARCH_NOT_FOUND = 'К сожалению тимейты на сегодня закончились 😔\nВозвращайся завтра 👉👈'
SEARCH_LIKE = 'Мы оповестили его/ее, о том, что тебе понравилась его анкета 👌'
SEARCH_LIKE_ERROR = 'Мы не смогли оповестить его/ее 😔\nВозможно человек заблокировал нас или запретил отправлять сообщения(\n\nНе отчаивайся и продолжай искать себе тимейтов 😊'
SEARCH_MESSAGE = 'Пользователю @{} понравилась ваша карточка по игре. Напиши ему!'